blog/emacs-server-name-frame-title.howto.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-01-04 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>How to display the Emacs Server Name in the Frame Title?</title>
<meta name="author" content="Dan Dee" />
<meta name="description" content="Emacs server: Set 'frame-title-format' using the 'server-name' variable" />
<meta name="keywords" content="howto, emacs server, server name, frame title, emacs, elisp" />
<meta name="generator" content="Org Mode" />
<meta http-equiv="Content-Security-Policy" content="default-src 'self'; script-src 'self' https://wa.skred.net/; connect-src https://wa.skred.net/; style-src 'self' https://*; img-src 'self' https://*; media-src 'self' https://*;">
<link rel="stylesheet" href="/static/normalize.css" type="text/css">
<link rel="stylesheet" href="/static/org.css" type="text/css">
<link rel="stylesheet" href="/static/style.css" type="text/css">
<link rel="stylesheet" href="/static/fonts/iosevka-etoile/fonts.css" type="text/css">
<link rel="stylesheet" href="/static/fonts/cormorant/fonts.css" type="text/css">
<link rel="stylesheet" href="/static/fonts/gentium-basic/fonts.css" type="text/css">
<link rel="stylesheet" href="/static/fonts/iosevka-aile/fonts.css" type="text/css">
<link rel="stylesheet" href="/static/fonts/iosevka/fonts.css" type="text/css">
<link rel="icon" type="image/svg+xml" href="/static/monkeyjunglejuice.svg">
<link rel="apple-touch-icon" href="/static/monkeyjunglejuice-icon180.png">
<link rel="canonical" href="https://monkeyjunglejuice.github.io/blog/emacs-server-name-frame-title.howto.html">
</head>
<body>
<div id="preamble" class="status">
<nav id="nav-primary"><a id="site-name" href="/index.html">MonkeyJungleJuice</a> <a id="about" href="/about.html">About</a><a id="github" href="https://github.com/monkeyjunglejuice">Github</a></nav>
<div class="info"><time itemprop="dateModified" datetime="2024-04-04">Last updated: 2024-04-04</time></div>
</div>
<div id="content" class="content">
<header>
<h1 class="title">How to display the Emacs Server Name in the Frame Title?</h1>
<p class="subtitle" role="doc-subtitle">A short How-To</p>
</header><p>
As you may know, the best way to optimize Emacs&rsquo; startup time by magnitudes is to <a href="https://www.gnu.org/software/emacs/manual/html_node/emacs/Emacs-Server.html">start a server instance</a> &#x2014; e.g. at login &#x2014; and then fire up a client <a href="https://www.gnu.org/software/emacs/manual/html_node/emacs/Invoking-emacsclient.html">Emacs client</a> to edit a file.<br>
</p>

<p>
There are some scenarios why one would run <i>more than one</i> Emacs server instance: Maybe to outsource tasks to another Emacs process for whatever reason <code>(server-eval-at "work" '(* 3 3))</code>, or to have separate workspaces &#x2013; eg. one for work and another for personal stuff &#x2013; like I do (there may be more sophisticated ways to implement workspaces in Emacs tough).<br>
</p>

<p>
You can start the servers via shell commands in your terminal, or put the commands into your autostart:<br>
</p>
<div class="org-src-container">
<pre class="src src-sh">emacs --daemon=work
emacs --daemon=personal
</pre>
</div>

<p>
And then connect to a server like:<br>
</p>
<div class="org-src-container">
<pre class="src src-sh">emacsclient -s personal -nc
</pre>
</div>

<p>
I thought it would be nice to see the server name in my <del>window</del> frame title to know in which frame I am (&rsquo;work&rsquo; or &rsquo;personal&rsquo;). <i>By the way, a &rsquo;frame&rsquo; in Emacs terminology means the ordinary desktop window.</i><br>
</p>

<p>
The simplest way to set a custom frame title goes like this:<br>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> <span class="org-variable-name">frame-title-format</span> <span class="org-string">"%b %f"</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
You put the expression into your <code>~/.emacs.d/init.el</code> or <code>~/.emacs</code> file, whatever exists on your system. <code>%b</code> stands for the name of the buffer you&rsquo;re currently in, and <code>%f</code> for the path of the file you&rsquo;re editing. You&rsquo;ll find a <a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/_0025_002dConstructs.html">full list of all variables</a> here.<br>
</p>

<p>
So what to do, if you want to have the server name there? Is there a variable <code>%X</code> for the server name? Of course not.<br>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> <span class="org-variable-name">frame-title-format</span> <span class="org-string">"%b %f %X"</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
We&rsquo;ll need to find another way to put the server name into the string. Luckily, Emacs already provides a variable <code>server-name</code> that holds the name of the Emacs server. The value of <code>server-name</code> is a string, and the <code>concat</code> function puts several strings together into one (noticed the string with a space <code>" "</code> between the quotes in the code block below? That&rsquo;s the separator between the file path and the server name; we&rsquo;re concatenating 3 strings here):<br>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> <span class="org-variable-name">frame-title-format</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-constant">concat</span> <span class="org-string">"%b %f"</span> <span class="org-string">" "</span> <span class="org-variable-name">server-name</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
But &#x2026; meh. The code is valid, but still doesn&rsquo;t work. &ldquo;server&rdquo; appears in the frame title instead of &ldquo;personal&rdquo;, because &ldquo;server&rdquo; is the default value of <code>server-name</code>.<br>
</p>

<p>
Turns out, the server starts towards the end of the initialization process, after all the things in &rsquo;init.el&rsquo; have done their thing. We cannot set the frame title just plainly in &rsquo;init.el&rsquo;, because if we do so, the frame title will be set <i>before</i> the server has been started and got its name, still with the default value of <code>server-name</code>.<br>
</p>

<p>
We have to make sure the frame title will be set <i>after</i> the server has started. We can <a href="https://www.gnu.org/software/emacs/manual/html_node/emacs/Hooks.html">use a hook</a> for that. There are many standard hooks in Emacs, and we have to <a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Init-File.html">find the right one</a> that runs after the server has been started. According to the <a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Startup-Summary.html">startup summary</a>, it seems like the <code>emacs-startup-hook</code> is run before <code>server-start</code> and therefore shouldn&rsquo;t work, but &#x2026; surprise, it works nevertheless:<br>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">  <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">add-hook</span> <span class="org-highlight-quoted-quote">'</span><span class="org-variable-name">emacs-startup-hook</span>
            <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">lambda</span> <span class="org-rainbow-delimiters-depth-3">()</span>
              <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-keyword">setq</span> <span class="org-variable-name">frame-title-format</span>
                    <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-constant">concat</span> <span class="org-string">"%b %f"</span> <span class="org-string">" "</span> <span class="org-variable-name">server-name</span><span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
What if we want to run Emacs without server-mode? In that case, the default value of <code>server-name</code> will be shown again. To get rid of it, we&rsquo;ll have to extend the <code>setq</code> form a bit:<br>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">  <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">add-hook</span> <span class="org-highlight-quoted-quote">'</span><span class="org-variable-name">emacs-startup-hook</span>
            <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">lambda</span> <span class="org-rainbow-delimiters-depth-3">()</span>
              <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-keyword">setq</span> <span class="org-variable-name">frame-title-format</span>
                    <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-constant">concat</span> <span class="org-string">"%b %f"</span>
                            <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">when</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-constant">server-running-p</span><span class="org-rainbow-delimiters-depth-2">)</span>
                              <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-constant">concat</span> <span class="org-string">" "</span> <span class="org-variable-name">server-name</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span><span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Or even better &#x2013; let&rsquo;s define a separate named function to set the frame title. That looks a bit more tidy when you hook more than one functions into <code>emacs-startup-hook</code>:<br>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">  <span class="org-comment-delimiter">;; </span><span class="org-comment">Define the function</span>
  <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defun</span> <span class="org-function-name">my-frame-title</span> <span class="org-rainbow-delimiters-depth-2">()</span>
    <span class="org-doc">"Set a custom frame title."</span>
    <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">setq</span> <span class="org-variable-name">frame-title-format</span>
          <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-constant">concat</span> <span class="org-string">"%b %f"</span>
                  <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-keyword">when</span> <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">server-running-p</span><span class="org-rainbow-delimiters-depth-1">)</span>
                    <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">concat</span> <span class="org-string">" "</span> <span class="org-variable-name">server-name</span><span class="org-rainbow-delimiters-depth-1">)</span><span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Run the hook to call the function</span>
  <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">add-hook</span> <span class="org-highlight-quoted-quote">'</span><span class="org-variable-name">emacs-startup-hook</span>
            <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">lambda</span> <span class="org-rainbow-delimiters-depth-3">()</span>
              <span class="org-rainbow-delimiters-depth-3">(</span>my-frame-title<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
<p>
The solution above works now if one summons the server via command line argument like described in the beginning (e. g. <code>emacs --daemon=personal</code>). But it doesn&rsquo;t work when starting the server from within Emacs via calling the function <code>server-mode</code> or the respective &rsquo;M-x server-mode&rsquo; command.<br>
</p>

<p>
To update the frame title when the server is started from within Emacs, we&rsquo;ll use another hook:<br>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">  <span class="org-comment-delimiter">;; </span><span class="org-comment">Define the function</span>
  <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defun</span> <span class="org-function-name">my-frame-title</span> <span class="org-rainbow-delimiters-depth-2">()</span>
    <span class="org-doc">"Set a custom frame title."</span>
    <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">setq</span> <span class="org-variable-name">frame-title-format</span>
          <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-constant">concat</span> <span class="org-string">"%b %f"</span>
                  <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-keyword">when</span> <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">server-running-p</span><span class="org-rainbow-delimiters-depth-1">)</span>
                    <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">concat</span> <span class="org-string">" "</span> <span class="org-variable-name">server-name</span><span class="org-rainbow-delimiters-depth-1">)</span><span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Run the hook to call the function while starting</span>
  <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">add-hook</span> <span class="org-highlight-quoted-quote">'</span><span class="org-variable-name">emacs-startup-hook</span>
            <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">lambda</span> <span class="org-rainbow-delimiters-depth-3">()</span>
              <span class="org-doc">"Functions to call after loading init files."</span>
              <span class="org-rainbow-delimiters-depth-3">(</span>my-frame-title<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Call the function after entering or leaving '</span><span class="org-comment"><span class="org-constant">server-mode</span></span><span class="org-comment">'</span>
  <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">add-hook</span> <span class="org-highlight-quoted-quote">'</span><span class="org-variable-name">server-mode-hook</span>
            <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">lambda</span> <span class="org-rainbow-delimiters-depth-3">()</span>
              <span class="org-doc">"Functions to apply after entering or leaving '</span><span class="org-doc"><span class="org-constant">server-mode</span></span><span class="org-doc">'."</span>
              <span class="org-rainbow-delimiters-depth-3">(</span>my-frame-title<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
<p>
That&rsquo;s all!<br>
</p>
</div>
<div id="postamble" class="status">
<div class="footer">Published by <span class="author"><a href="/about.html">Dan Dee</a></span></div>
<script defer src="/static/footer.js"></script>
</div>
</body>
</html>
